Documents/ОплатаУслугМВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОплатаУслугМВК</Name>
			<Comment>Прийняття оплати за надані послуги по Миргородводоканал</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОплатаУслугМВК/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ОплатаУслугМВК.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
    // Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоРегиональнымСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	//Документы.ОплатаУслугМВК.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	// Создадим документ корректировки показаний приборов учета
	//Для Каждого стр Из РасшифровкаПлатежа Цикл
	//	Если стр.ТекущиеПоказания <> 0 Тогда
	//		Док = Документы.ВводПоказанийПриборовВоды.СоздатьДокумент();
	//		Док.Дата = Дата;
	//		Док.ЛицевойСчет = ЛицевойСчет;
	//		Док.Здание = ЛицевойСчет.Владелец;
	//		Док.Комментарий = НСтр("ru = 'Создано автоматически документом ""Оплата услуг МВК"".'; uk = 'Створено автоматично документом ""Оплата послуг МВК"".'");
	//		Док.Организация = Организация;
	//		Док.ПериодНачисления = Док.Дата;

	//		НовСтр = Док.ПриборыУчета.Добавить();
	//		НовСтр.ВидТарифа = Перечисления.ВидыТарифов.Общий;
	//		НовСтр.Источник = Перечисления.ИсточникиПоказаний.Банк;
	//		НовСтр.ПриборУчета = стр.НомерСчетчика;		
	//		Если стр.ТекущиеПоказания = 0 Тогда
	//			НовСтр.ТекущиеПоказания = НовСтр.ПредыдущиеПоказания;
	//		Иначе
	//			НовСтр.ТекущиеПоказания = стр.ТекущиеПоказания;
	//		КонецЕсли;
	//		НовСтр.ПредыдущиеПоказания = стр.ПредыдущиеПоказания;
	//		НовСтр.КвоКубов = стр.ТекущиеПоказания - стр.ПредыдущиеПоказания;
	//		НовСтр.Услуга = стр.Услуга;
	//		Попытка
	//			Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//		Исключение
	//			Док.Записать();
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Текст = НСтр("ru = 'Не удалось провести документ '; uk = 'Не вдалося провести документ '" + Док.Ссылка); 
	//			Сообщение.Сообщить();
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Для Каждого стр Из РасшифровкаПлатежа Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		    "ВЫБРАТЬ
		    |	ВводПоказанийПриборовВоды.Ссылка
		    |ИЗ
		    |	Документ.ВводПоказанийПриборовВоды КАК ВводПоказанийПриборовВоды
		    |ГДЕ
		    |	ВводПоказанийПриборовВоды.ЛицевойСчет = &ЛицевойСчет
		    |	И ВводПоказанийПриборовВоды.Дата = &Дата
		    |	И ВводПоказанийПриборовВоды.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Запрос.УстановитьПараметр("Дата", Дата);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокВВодПоказаний = Выборка.Ссылка.ПолучитьОбъект();
			ДокВВодПоказаний.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ДокВВодПоказаний.ПометкаУдаления = ИСТИНА;
			ДокВводПоказаний.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
